// (1) 除了括号之外,不能出现其他符号 
// (2) 出现了括号的话, 必须是两组! (即要么没括号, 要么是两组括号，不能多于2组)，括号里面、周围都可以有内容中英文+数字 

// 愚蠢的方法
let reg = /^[a-zA-Z0-9\u4e00-\u9fa5]*(?:[(][a-zA-Z0-9\u4e00-\u9fa5]*[)][a-zA-Z0-9\u4e00-\u9fa5]*[(][a-zA-Z0-9\u4e00-\u9fa5]*[)]){0,1}[a-zA-Z0-9\u4e00-\u9fa5]*$/;
let reG = /^[a-zA-Z0-9\u4e00-\u9fa5]*(?:\([a-zA-Z0-9\u4e00-\u9fa5]*\)[a-zA-Z0-9\u4e00-\u9fa5]*\([a-zA-Z0-9\u4e00-\u9fa5]*\)){0,1}[a-zA-Z0-9\u4e00-\u9fa5]*$/

// 正则是可以引用子表达式的，但是失败了？ 
let Reg = /^([a-zA-Z0-9\u4e00-\u9fa5]*)(?:[(]\1[)]\1[(]\1[)]){0,1}\1$/
// 后向引用会直接拿子表达式匹配的结果去核对！！！而不是拿子表达式去匹配！！